function fit=fitness(pop)
%   pop为输入种群，其是(0,1)之间的随机数，需要进行解码处理
%   参数范围a->(0,2)  b1->(-2,2)  b2->(-1,1)
%   x为系统的输入序列(此处为白噪声)
%   fit为计算得到的适应度值

    %-------------计算适应度时需将参数解码--------------%
    a0c=pop(:,1);b1c=pop(:,2);b2c=pop(:,3);
    a0=a0c*(2-0)+0;
    b1=b1c*(2+2)-2;
    b2=b2c*(1+1)-1;     %解码后得到a0  b1  b2的真实值
    w=[a0,b1,b2];
    
    N=100;              %测试序列的长度
    x=randn(1,N);       %测试序列（取100个作误差平方的统计平均）
    fit=zeros(1,size(pop,1));   %适应度函数
    
    %----------------计算适应度----------------%
    for i=1:size(w,1)
        er=zeros(size(x));y=zeros(size(x));d=zeros(size(x));
        y(1)=w(i,1)*x(1);d(1)=x(1);
        er(1)=y(1)-d(1);
        y(2)=w(i,1)*x(2)+w(i,2)*y(1);d(2)=x(2)+1.2*y(1);
        er(2)=y(2)-d(2);
        for k=3:N
            y(k)=w(i,1)*x(k)+w(i,2)*y(k-1)+w(i,3)*y(k-2);   %实际输出
            d(k)=x(k)+1.2*y(k-1)-0.6*y(k-2);                %系统期望输出
            er(k)=y(k)-d(k);                                %误差
        end
        fit(i)=1/N*sum(er.^2);      %适应度取输出均方误差
    end
 
end